tutorials/cases/LEIgasifier/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistry           on;

chemistryType
{
    solver            ode;
}

solidChemistryType
{
    solver              solidOde;
    method              ODESolidHeterogeneousChemistryModel;
    solidThermoType     const<constRad<constThermo<constRho>>>;
}

initialChemicalTimeStep 1e-10;

turbulentReaction   off;
solidReactionEnergyFromEnthalpy false;
stoichiometricReactions false;
showRelativeReactionRates false;
solidChemistryTimeStepControl false;

// On: without the mass-transfer ceiling, char oxidation runs on the previous
// timestep's frozen O2 field and burns char against oxygen the cell does not
// have (issue #92, Finding B). A negative gas concentration reaching the
// diffusion block now aborts explicitly in omega()/jacobian() rather than
// sending 1/addAvKf to infinity.
diffusionLimitedReactions true;

odeCoeffs
{
    solver   seulex;
    absTol   1e-8;
    relTol   1e-4;
}

// RKCK45 (explicit Cash-Karp) avoids Jacobian inversion.
// seulex requires the Jacobian; when Ychar=Yash=0 (cold start) those rows
// are identically zero → singular matrix → step-size underflow SIGFPE.
// Staying on RKCK45: the diagonal regularisation that would let seulex
// survive that is a crash-suppressor and is not on this branch.
solidOdeCoeffs
{
    solver   RKCK45;
    absTol   1e-8;
    relTol   1e-4;
}

#include "reactions"

solidReactions
(
    // R1 — Drying  (Ibrahim 2025, Table 5.4; A=5.13e6 1/s, Ta=1.06e4 K)
    irreversibleSolidArrheniusHeterogeneousReaction
    hum = H2O
    (5.13e6 1.0589e4 300 2.256e6 1)

    // R24 — Wood pyrolysis, merged single reaction (was R24a+b+c, split by
    // product fraction only — same kinetics, coefficient 1 instead of three
    // fractional ones, which also sidesteps issue #92 Finding A's
    // totalSubstrates degeneracy for this reaction). Product coefficients
    // rescaled by 1/0.997 from the raw literature split (0.74/57.4/41.6 wt%,
    // which itself only sums to 99.70%): the solver's omega() enforces
    // mass conservation to floating-point precision and aborts on a
    // mismatch, which the original three fragments only dodged by each
    // balancing against its own sub-coefficient.
    irreversibleSolidArrheniusHeterogeneousReaction
    wood = 0.0074 char + 0.2069 CO + 0.3397 CO2 + 0.0289 H2 + 0.0569 H2O + 0.0172 CH4 + 0.3430 tar
    (1.38e10 1.9e4 300 3.85e5 1)

    // R7 — Char full oxidation → CO2  (Ibrahim 2025, Table 5.4)
    irreversibleSolidArrheniusHeterogeneousReaction
    char + 2.66 O2 = 3.66 CO2
    (5.61e9 1.96e4 300 -8.94e6 1 1)

    // R3 — Boudouard: char + CO2 → CO  (Ibrahim 2025, Table 5.4)
    irreversibleSolidArrheniusHeterogeneousReaction
    char + 3.66 CO2 = 4.66 CO
    (3.616e4 9308.39 300 3.07e6 1 1)

    // R6 (partial oxidation → CO), R4 (water-gas) and R5 (hydrogasification)
    // dropped — see lei-gasifier-continuity-us-field-2026-09-14.md Decision 2.
);

// ************************************************************************* //
