tutorials/cases/LEIgasifier/constant/solidThermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      solidThermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType solidMixtureThermo<constHeterogeneous>;

solidComponents
(
    char ash wood hum
);

humCoeffs
{
    transport
    {
	    K           0.58;
    }
    thermodynamics
    {
        Cp          4200;
        Hf         -15.86e6;
    }
    density
    {
        rho         1000;
    }
};

charCoeffs
{
    transport
    {
        K           0.156; // (0.071+0.105+0.105)/3./.6  Park2010, Asako2002
    }
    thermodynamics
    {
        Cp          1054; // Park2010 for T=300
        Hf          -2.12e4;
    }
    density
    {
        rho           1050;
    }
};

woodCoeffs
{
    transport
    {
        K           0.23;  // Park et al. via Ibrahim (2025)
    }
    thermodynamics
    {
        Cp          2000;  // Park et al. via Ibrahim (2025)
        Hf          -4.675e6; // -109870 J/mol / 0.0235 kg/mol (Ibrahim 2025)
    }
    density
    {
        rho          1050;
    }
};

ashCoeffs
{
    transport
    {
        K           0.15;
    }
    thermodynamics
    {
        Cp          2400;
        Hf          -12.38e6;
    }
    density
    {
        rho           3000;
    }
};

// ************************************************************************* //
